
#Область ОбработчикиСобытийТабличнаяЧасть

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РасчитатьСуммуПоСтроке(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РасчитатьСуммуПоСтроке(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура РасчитатьСуммуПоСтроке(ТекущиеДанные)
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;	
КонецПроцедуры

#КонецОбласти






